{
  "backend/main.mo": "Motoko actor implementing user profiles, admin role management, and CRUD operations for property records with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report documenting a deployment-retry task and its associated files, components, and test ID.",
  "frontend-file-summaries.txt": "Text file listing short summaries of numerous frontend files for reference or documentation.",
  "frontend/DEPLOYMENT_RETRY.md": "Guide describing how to retry deployment of the current application revision using clean build steps.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining OKLCH color tokens and light/dark theme variables.",
  "frontend/index.html": "HTML entry point loading fonts, favicon, and mounting the React app in the root div.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for Home, Properties, Inquiries, and Admin pages using SiteLayout.",
  "frontend/src/components/admin/AdminManagementPanel.tsx": "Admin panel for granting and revoking admin rights via principal IDs with mutation status feedback.",
  "frontend/src/components/auth/BootstrapAdminHelper.tsx": "Guides non-admin users on how to gain admin access and displays their principal ID with copy functionality.",
  "frontend/src/components/auth/HomepageAuthButton.tsx": "Login/logout button that handles Internet Identity authentication and resets query state on logout.",
  "frontend/src/components/auth/MyPrincipalCard.tsx": "Shows the user’s principal ID with a copy-to-clipboard button for sharing with admins.",
  "frontend/src/components/BusinessInfoBlock.tsx": "UI block displaying business name, address, and phone with icons using siteData.",
  "frontend/src/components/home/HeroSection.tsx": "Landing page hero section with marketing text, property image, contact options, and an auth button.",
  "frontend/src/components/inquiries/InquiryForm.tsx": "Frontend-only inquiry form with validation, fake submission delay, and success/error messaging.",
  "frontend/src/components/inquiries/InquiryList.tsx": "Displays a list of inquiries with name, contact details, interest, and message content.",
  "frontend/src/components/layout/ContactBar.tsx": "Renders contact and social media buttons with compact and default display variants.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing business info, contact details, hours, and a small attribution note.",
  "frontend/src/components/layout/Header.tsx": "Main site header with navigation, branding, compact contact bar, and conditional admin link.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main app layout with header, footer, and routed content via Outlet.",
  "frontend/src/components/properties/InlinePropertyForm.tsx": "Provides an inline form for creating or editing properties with image and video upload support.",
  "frontend/src/components/properties/PropertyCard.tsx": "Displays a property with images, video, and admin edit/delete controls, switching to inline editing when needed.",
  "frontend/src/components/properties/PropertyEditorModal.tsx": "Modal-based property editor allowing title, description, price, and image updates.",
  "frontend/src/components/properties/PropertyImageGallery.tsx": "Image carousel component with navigation and error handling for invalid images.",
  "frontend/src/components/properties/PropertyList.tsx": "Renders a grid of PropertyCard components or an empty state when no properties exist.",
  "frontend/src/data/siteData.ts": "Defines the Property interface and provides static business info, social links, and seed property data.",
  "frontend/src/hooks/useActor.ts": "React hook creating and managing a backend actor based on identity, refetching dependent queries on change.",
  "frontend/src/hooks/useAdminDiagnostics.ts": "Fetches backend admin diagnostics and derives environment metadata for debugging, with fallback logic for missing or unauthorized methods.",
  "frontend/src/hooks/useAdminManagement.ts": "Provides grant and revoke admin mutations with error normalization and query invalidation for admin-related state.",
  "frontend/src/hooks/useChunkedVideoPlayback.ts": "Loads a video blob’s direct URL for playback and manages loading, error, and cleanup state.",
  "frontend/src/hooks/useChunkedVideoUpload.ts": "Handles client-side video upload to an ExternalBlob with MIME validation and progress tracking.",
  "frontend/src/hooks/useInquiries.ts": "Returns an empty inquiries list as backend support is removed, with a simple react-query wrapper.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login flow, and identity persistence via an AuthClient-backed provider.",
  "frontend/src/hooks/useLocalStorage.ts": "Synchronizes React state with localStorage using a getter/setter wrapper.",
  "frontend/src/hooks/usePropertyListings.ts": "Fetches and mutates property listings via actor calls, normalizing errors and refreshing queries on changes.",
  "frontend/src/hooks/useQueries.ts": "Queries whether the current identity is an admin using available actor methods with fallback and error handling.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes using HSL-like custom properties.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard handling authentication, admin checks, diagnostics display, and inquiry management UI states.",
  "frontend/src/pages/HomePage.tsx": "Home page showing hero content, features, and an inquiry contact section with marketing blocks.",
  "frontend/src/pages/InquiriesPage.tsx": "Renders a standalone inquiry submission page with title and InquiryForm.",
  "frontend/src/pages/PropertiesPage.tsx": "Property listing page with admin‑only create/update/delete actions and inline forms using property listing hooks.",
  "frontend/src/README-content-transfer.md": "Guide on transferring business info, property data, and images from the site to Google Sites.",
  "frontend/src/types/index.ts": "Defines simple frontend-only types for UserProfile and Inquiry data structures.",
  "frontend/src/types/propertyVideo.ts": "Provides video type detection logic for YouTube URLs, uploaded blobs, or none.",
  "frontend/src/utils/fileToDataUrl.ts": "Converts image files to data URLs with basic type and size validation.",
  "frontend/src/utils/icError.ts": "Normalizes Internet Computer errors into categorized, user-friendly messages.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/src/utils/videoFileToDataUrl.ts": "Converts video files to data URLs without size limits for chunked uploads.",
  "frontend/src/utils/youtube.ts": "Utility functions to extract YouTube video IDs from multiple URL formats and generate embeddable URLs.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project state describing admin‑related requirements, issues, and feature requests, focusing on preserving and restoring admin principals across deployments."
}