{
  "backend/main.mo": "Motoko actor providing user profile management, admin role control, and CRUD operations for property listings with access checks and blob storage support.",
  "feature_evidence.json": "Report describing a feature to grant an admin role to a specific principal across environments, listing affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of short descriptions summarizing all major frontend files and their responsibilities.",
  "frontend/index.css": "Global Tailwind-based styles defining color tokens, theming variables, and dark mode overrides.",
  "frontend/index.html": "HTML entry point loading fonts, favicon, and mounting the React application.",
  "frontend/src/App.tsx": "Main React router setup defining routes for Home, Properties, Inquiries, and Admin pages using SiteLayout.",
  "frontend/src/components/admin/AdminManagementPanel.tsx": "Admin UI panel enabling granting and revoking admin access via principal IDs with success and error handling.",
  "frontend/src/components/auth/BootstrapAdminHelper.tsx": "UI helper explaining bootstrap admin access, showing current principal and copy option when user is not an admin.",
  "frontend/src/components/auth/HomepageAuthButton.tsx": "Login/logout button using Internet Identity with reactive status and retry on auth collision.",
  "frontend/src/components/auth/MyPrincipalCard.tsx": "Displays the user's principal ID with a copy-to-clipboard button for admin access requests.",
  "frontend/src/components/BusinessInfoBlock.tsx": "Component displaying business name, address, and phone with icons using data from siteData.",
  "frontend/src/components/home/HeroSection.tsx": "Homepage hero section with marketing text, contact bar, auth button, and hero image.",
  "frontend/src/components/inquiries/InquiryForm.tsx": "Client-side inquiry form with validation, mock submission, and success/error UI states.",
  "frontend/src/components/inquiries/InquiryList.tsx": "Renders a list of inquiries with name, email, property interest, and message, or an empty state.",
  "frontend/src/components/layout/ContactBar.tsx": "Responsive contact/social bar linking to phone, maps, YouTube, Facebook, and Instagram.",
  "frontend/src/components/layout/Footer.tsx": "Footer showing business info, contact details, hours, and a small attribution.",
  "frontend/src/components/layout/Header.tsx": "Top navigation bar with branding, links, compact contact bar, and conditional admin link.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main page layout with header, footer, and routed content outlet.",
  "frontend/src/components/properties/InlinePropertyForm.tsx": "Provides an inline form for creating or editing properties with support for image URLs, uploads, and YouTube or uploaded videos.",
  "frontend/src/components/properties/PropertyCard.tsx": "Displays a property with images, video, details, and admin edit/delete controls, switching to an inline editor when editing.",
  "frontend/src/components/properties/PropertyEditorModal.tsx": "Modal-based property editor allowing title, description, price, location, and image management.",
  "frontend/src/components/properties/PropertyImageGallery.tsx": "Renders an image carousel with navigation, load error handling, and indicators.",
  "frontend/src/components/properties/PropertyList.tsx": "Lists properties in a grid and shows empty state messaging; supports admin update/delete actions.",
  "frontend/src/data/siteData.ts": "Defines property interface, static business info, social links, and seed property data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity, refetching dependent queries on identity change.",
  "frontend/src/hooks/useAdminDiagnostics.ts": "Fetches backend admin diagnostics and environment details using React Query with fallback logic.",
  "frontend/src/hooks/useAdminManagement.ts": "Provides grant and revoke admin mutations with error normalization and query invalidation.",
  "frontend/src/hooks/useChunkedVideoPlayback.ts": "Loads a video blob's direct URL for playback and manages loading and error state.",
  "frontend/src/hooks/useChunkedVideoUpload.ts": "Handles client-side video upload with progress tracking and returns an ExternalBlob.",
  "frontend/src/hooks/useInquiries.ts": "Returns an empty inquiries list while backend inquiry support is disabled.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context, managing login, logout, identity loading, and status states.",
  "frontend/src/hooks/useLocalStorage.ts": "Syncs a React state value with localStorage for persistent storage.",
  "frontend/src/hooks/usePropertyListings.ts": "Provides property listing queries and create/update/delete mutations with error handling and cache refresh.",
  "frontend/src/hooks/useQueries.ts": "Checks whether the current caller is an admin using fallback methods and React Query.",
  "frontend/src/index.css": "Defines Tailwind base styles and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminPage.tsx": "Admin interface handling authentication, admin checks, diagnostics, and inquiry management with multiple conditional UI states.",
  "frontend/src/pages/HomePage.tsx": "Public homepage displaying hero content, business highlights, and an inquiry section.",
  "frontend/src/pages/InquiriesPage.tsx": "Standalone page showing an inquiry form for contacting the business.",
  "frontend/src/pages/PropertiesPage.tsx": "Property listings page with admin‑only create, update, and delete functionality using related hooks.",
  "frontend/src/README-content-transfer.md": "Guide explaining how to export content, images, and data for transfer to Google Sites.",
  "frontend/src/types/index.ts": "Defines simple frontend-only types for user profiles and inquiries.",
  "frontend/src/types/propertyVideo.ts": "Defines property video type variants and logic to classify videos as YouTube, uploaded, or none.",
  "frontend/src/utils/fileToDataUrl.ts": "Converts image files to data URLs with basic validation and size checks.",
  "frontend/src/utils/icError.ts": "Normalizes IC canister errors into categorized, user-friendly messages.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL and session parameters.",
  "frontend/src/utils/videoFileToDataUrl.ts": "Converts video files to data URLs without size limits for chunked uploads.",
  "frontend/src/utils/youtube.ts": "Provides utilities to extract a YouTube video ID, validate YouTube URLs, and generate embed URLs across multiple URL formats.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, typography, animations, container settings, and plugin integrations.",
  "project_state.json": "Defines the project state, including admin-related requirements, existing features, and pending feature requests."
}