{
  "backend/main.mo": "Main backend canister implementing user profiles, admin role management, and CRUD operations for properties with access control and blob storage mixins.",
  "backend/migration.mo": "Defines types from a previous version and a no-op migration function returning the old actor state unchanged.",
  "feature_evidence.json": "Feature evidence report listing files and components involved in the admin workflow verification feature.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend source files for quick reference.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light/dark mode with custom OKLCH color tokens.",
  "frontend/index.html": "HTML entry point loading Inter font, favicon, and mounting the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for home, properties, inquiries, and admin pages using SiteLayout.",
  "frontend/src/components/admin/AdminManagementPanel.tsx": "UI panel for granting and revoking admin access with form inputs and mutation state handling.",
  "frontend/src/components/auth/BootstrapAdminHelper.tsx": "Shows guidance for obtaining admin access, including displaying and copying the user's principal ID when they are not an admin.",
  "frontend/src/components/auth/HomepageAuthButton.tsx": "Provides a login/logout button tied to Internet Identity, handling authentication status and errors.",
  "frontend/src/components/auth/MyPrincipalCard.tsx": "Displays the authenticated user's principal ID with a copy-to-clipboard button.",
  "frontend/src/components/BusinessInfoBlock.tsx": "Displays business name, address, and phone number using data from siteData.",
  "frontend/src/components/home/HeroSection.tsx": "Renders the homepage hero section with a title, description, contact bar, auth button, and hero image.",
  "frontend/src/components/inquiries/InquiryForm.tsx": "Implements a client-side inquiry form with validation and simulated submission feedback.",
  "frontend/src/components/inquiries/InquiryList.tsx": "Displays a list of inquiries with user details and message content, or a placeholder if empty.",
  "frontend/src/components/layout/ContactBar.tsx": "Shows contact and social media buttons with compact and default layout variants.",
  "frontend/src/components/layout/Footer.tsx": "Renders footer with business info, contact details, hours, and attribution.",
  "frontend/src/components/layout/Header.tsx": "Provides the main site header with navigation links, branding, contact bar, and conditional admin link.",
  "frontend/src/components/layout/SiteLayout.tsx": "Defines the main site layout with header, footer, and routed content via Outlet.",
  "frontend/src/components/properties/InlinePropertyForm.tsx": "Provides an inline form for creating or editing properties, supporting image uploads, YouTube video links, and chunked video uploads.",
  "frontend/src/components/properties/PropertyCard.tsx": "Displays a property with images, video, and admin edit/delete controls, switching to InlinePropertyForm when editing.",
  "frontend/src/components/properties/PropertyEditorModal.tsx": "Modal-based property editor handling basic fields and image uploads for adding or modifying a property.",
  "frontend/src/components/properties/PropertyImageGallery.tsx": "Image carousel for property photos with navigation and error handling for failed image loads.",
  "frontend/src/components/properties/PropertyList.tsx": "Renders a grid of PropertyCard components or an empty state message, passing admin callbacks when applicable.",
  "frontend/src/data/siteData.ts": "Defines the Property interface and provides business info, social links, and seeded sample property data.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to user identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminDiagnostics.ts": "Fetches backend admin diagnostics including caller principal, admin list, and admin status with error fallbacks.",
  "frontend/src/hooks/useAdminManagement.ts": "Provides grant and revoke admin mutations with error normalization and query invalidation.",
  "frontend/src/hooks/useChunkedVideoPlayback.ts": "Loads a video blob into a direct streaming URL and tracks loading/error state.",
  "frontend/src/hooks/useChunkedVideoUpload.ts": "Uploads video files by converting to bytes, tracking progress, and returning an ExternalBlob.",
  "frontend/src/hooks/useInquiries.ts": "Stub hook returning an empty inquiries list until backend support returns.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login, logout, and identity persistence via context.",
  "frontend/src/hooks/useLocalStorage.ts": "Synchronizes a React state value with localStorage for persistence.",
  "frontend/src/hooks/usePropertyListings.ts": "Handles querying, creating, updating, and deleting property listings with actor API and error normalization.",
  "frontend/src/hooks/useQueries.ts": "Checks whether the caller is an admin using available backend methods with fallbacks.",
  "frontend/src/index.css": "Tailwind base setup defining light and dark theme CSS variables for colors and layout.",
  "frontend/src/main.tsx": "App entrypoint initializing React, query client, Internet Identity provider, and global styles.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard that handles authentication, admin checks, diagnostics, and displays inquiries with refresh and error states.",
  "frontend/src/pages/HomePage.tsx": "Homepage rendering hero content, business highlights, and an inquiry contact section.",
  "frontend/src/pages/InquiriesPage.tsx": "Simple page showing an inquiry form with a title and description.",
  "frontend/src/pages/PropertiesPage.tsx": "Property management and listing page with admin-only create/update/delete actions and form handling.",
  "frontend/src/README-content-transfer.md": "Guide explaining how to copy business info, properties, and images to platforms like Google Sites.",
  "frontend/src/types/index.ts": "Defines basic frontend-only types for user profiles and inquiries.",
  "frontend/src/types/propertyVideo.ts": "Defines property video type variants and logic to detect YouTube, uploaded, or none video types.",
  "frontend/src/utils/fileToDataUrl.ts": "Converts image files to data URLs with type and size validation.",
  "frontend/src/utils/icError.ts": "Normalizes IC canister errors into categorized, user-friendly messages.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, storing, and clearing URL or session parameters, including hash-based routing.",
  "frontend/src/utils/videoFileToDataUrl.ts": "Converts video files to data URLs without size limits.",
  "frontend/src/utils/youtube.ts": "Extracts YouTube IDs, validates URLs, and generates embed URLs for multiple URL formats.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container queries, animations, and theme extensions for the frontend.",
  "project_state.json": "Defines the project’s admin-system requirements, known issues, feature requests, and state metadata for improving persistent admin management."
}