{
  "kind": "build_request",
  "title": "Fix property creation failures and make video support reliable for property listings",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the “Failed to create property” flow so users see the real underlying reason (e.g., not an admin, request too large, invalid input), and ensure the UI guides the user to resolve it.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Fix the error why it coming when I try to list a property",
          "Failed to create property error coming when I try to list a property"
        ]
      },
      "acceptanceCriteria": [
        "When property creation fails, the UI displays a specific error message that distinguishes at least: (1) permission/admin issue, (2) request too large (payload/video/image too big), and (3) generic backend failure.",
        "The error message shown to the user must not always be the generic string “Failed to create property. Please try again.” if a more specific reason is available from the canister/agent error.",
        "The Properties page shows clear next-step guidance when the user is authenticated but not an admin (e.g., “You are logged in but do not have admin access.”)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Make video attachment for property listings work end-to-end by supporting YouTube URLs reliably and preventing video uploads that exceed Internet Computer request limits, with clear user-facing validation and messaging.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "I can't add video",
          "Ok create"
        ]
      },
      "acceptanceCriteria": [
        "In the property create/edit form, adding a valid YouTube URL saves successfully and renders as an embedded video on the property card.",
        "If a user attempts to upload a video file that is too large to be safely stored/sent (based on the app’s configured limit), the form blocks submission and shows a clear English error explaining the size limit.",
        "If a user uploads a video file within the configured limit, it saves successfully and plays via an HTML5 <video> element on the property card.",
        "Backend rejects invalid video values (neither a YouTube URL nor a data:video/* data URL) with a clear trap message; the frontend surfaces this message.",
        "Backend enforces a maximum allowed size/length for the video text field (and rejects overly large payloads early with a clear trap message)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure property CRUD is usable by admins out of the box by making the initial admin bootstrap path clear and functional, so authorized users can create listings without hitting authorization traps.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "My website",
          "I am using you caffeine ai that's your website that you have made"
        ]
      },
      "acceptanceCriteria": [
        "If the current caller is not an admin, the UI does not present the add/edit/delete controls and instead shows an explanation of why (admin-only).",
        "If the canister has a configured bootstrap admin Principal (already present in backend), that Principal can create/update/delete properties successfully after logging in with Internet Identity.",
        "If the current caller triggers an admin-only trap (create/update/delete property), the frontend surfaces a permission-specific error message (not a generic failure)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; only add backend/migration.mo if a stable-state upgrade is required.",
    "Do not modify files under frontend/src/components/ui or any paths listed in frontend.immutablePaths.",
    "Use English for all user-facing UI text.",
    "Do not add external databases or third-party storage/services for video hosting."
  ],
  "nonGoals": [
    "Building real-time updates (WebSockets) for new listings.",
    "Adding third-party authentication providers (only Internet Identity).",
    "Adding external video hosting/CDN integrations or storing large video files off-canister."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}