{
  "kind": "build_request",
  "title": "Show Admin navbar button only for admins (after Home, Properties, Inquiries)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the site header navigation so that the navbar order is always: Home, Properties, Inquiries, then Admin; and render the Admin link only when the current authenticated user is an admin.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "user-last"
        ],
        "quotes": [
          "add the Admin button in the navbar after Home, Properties, and Inquiries but admin button only appears to admins"
        ]
      },
      "acceptanceCriteria": [
        "When logged in as a non-admin, the navbar shows Home, Properties, Inquiries, and does not show Admin.",
        "When logged in as an admin, the navbar shows Home, Properties, Inquiries, Admin (Admin appears after Inquiries).",
        "This ordering is consistent in both desktop and mobile header navigation.",
        "The Inquiries link is present on the Home page as well (so the Admin link can consistently appear after it)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix admin-status detection so the frontend’s admin check reliably returns a boolean for authenticated users (so the Admin navbar link can appear for admins). Ensure the backend exposes a query method named isCallerAdmin() that matches the frontend call signature, or update the frontend admin-check hook(s) to call the backend’s existing checkIfCallerIsAdmin() endpoint consistently.",
      "target": "both",
      "source": {
        "messageIds": [
          "user-last"
        ],
        "quotes": [
          "admin button only appears to admins"
        ]
      },
      "acceptanceCriteria": [
        "For an authenticated admin principal, the admin-status query resolves to true and the Admin navbar link becomes visible without manual page code changes.",
        "For an authenticated non-admin principal, the admin-status query resolves to false and the Admin navbar link remains hidden.",
        "No runtime errors occur from missing backend methods during admin-status checks (e.g., in the navbar and in admin diagnostics)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (shadcn components are read-only).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Keep all backend logic in the single Motoko actor in backend/main.mo; add migration code only if state upgrades are required."
  ],
  "nonGoals": [
    "Do not implement an admin signup flow or change how admin privileges are granted beyond what is required to correctly detect admin status for showing the navbar link.",
    "Do not add new pages or routes beyond using the existing /admin route already present."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}