{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Conditional Admin navbar link (admins only) with consistent nav ordering",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure header navbar ordering is Home, Properties, Inquiries, Admin, and show Admin only to authenticated admins across desktop and mobile (including on Home).",
      "acceptanceCriteria": [
        "When logged in as a non-admin, the navbar shows Home, Properties, Inquiries, and does not show Admin.",
        "When logged in as an admin, the navbar shows Home, Properties, Inquiries, Admin (Admin appears after Inquiries).",
        "This ordering is consistent in both desktop and mobile header navigation.",
        "The Inquiries link is present on the Home page as well (so the Admin link can consistently appear after it)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/Header.tsx",
          "operation": "modify",
          "description": "Update desktop and mobile nav rendering so Inquiries is always present (including on '/'), enforce consistent link order (Home, Properties, Inquiries, then conditional Admin), and keep Admin hidden unless the authenticated user is an admin. Verify the component's usage instructions before implementing (authorization: role-based access control drives the admin visibility via the admin-check hook)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make frontend admin-status detection reliably resolve to a boolean for authenticated users by calling the backend admin-check function consistently (with safe fallback between isCallerAdmin() and checkIfCallerIsAdmin()).",
      "acceptanceCriteria": [
        "For an authenticated admin principal, the admin-status query resolves to true and the Admin navbar link becomes visible without manual page code changes.",
        "For an authenticated non-admin principal, the admin-status query resolves to false and the Admin navbar link remains hidden.",
        "No runtime errors occur from missing backend methods during admin-status checks (e.g., in the navbar and in admin diagnostics)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden useIsCallerAdmin() to always return a boolean for authenticated users by attempting actor.isCallerAdmin() first and gracefully falling back to actor.checkIfCallerIsAdmin() if needed; also ensure missing-method cases do not throw runtime errors and unauthorized-style errors resolve to false. Verify the component's usage instructions before implementing (authorization: role-based access control admin check)."
        },
        {
          "path": "frontend/src/hooks/useAdminDiagnostics.ts",
          "operation": "modify",
          "description": "Align diagnostics admin-status fetch with the same robust admin-check logic used by the navbar (prefer isCallerAdmin(), fallback to checkIfCallerIsAdmin()), ensuring the hook never breaks due to a missing backend method and always produces a boolean admin status when authenticated. Verify the component's usage instructions before implementing (authorization: role-based access control admin check)."
        }
      ]
    }
  ]
}