{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Build and fix an admin system for the live app, including persistent backend admin storage with initial admin setup and a frontend UI to add/revoke admins.",
  "architectural_notes": [
    "Internet Identity issues different principals per dapp/domain; draft vs live domains will yield different principals, so admins must be stored/managed per-principal accordingly.",
    "Admin list must be stored persistently in canister state (not hardcoded) and initialized with a chosen initial admin at deploy/upgrade."
  ],
  "known_issues": [
    "Admins disappear in live due to missing persistent admin storage and no initial admin being set; hardcoded admin list does not reflect state."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-verify-and-adjust-the-admin-page-workflow-so-it-works-end-to-end-with-the-corrected-backend-admin-check-diagnostics-and-grant-revoke-actions-update-the-ui-state-after-mutations",
      "title": "Verify and adjust the Admin page workflow so it works end-to-end with the corrected backend: admin check, diagnostics, and grant/revoke actions update the UI state after mutations.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Fix backend admin system: persist admin storage in canister and set initial admin on deploy so admin does not disappear in live",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Add frontend admin-management UI (add/revoke admins and view admin list) to avoid calling endpoints manually",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Bootstrap backend admin authorization so that the principal `enn3j-adkwy-i7cxf-gi4bs-ihisb-mpsqc-lozg5-coeen-cba7n-y352m-4ae` is an admin immediately after a fresh install, and remains an admin after upgrades.",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Persist backend authorization/admin state in stable memory so that admins do not disappear when switching from draft to live deployments or when upgrading the canister.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-5",
      "summary": "Ensure the backend supports multiple admins and exposes working admin-management endpoints compatible with the existing frontend Admin Management UI (grant and revoke admin privileges for other principals).",
      "reqIds": [
        "REQ-3"
      ],
      "status": "pending"
    },
    {
      "id": "AR-6",
      "summary": "Fix the backend admin diagnostics so `getAdminsList()` returns the actual current admin principal list from the backend authorization state (not a hardcoded list).",
      "reqIds": [
        "REQ-4"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Fix persistent admin system (bootstrap admin + real admin list) and ensure Admin UI works end-to-end",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}